<?php

return [
    /*
    |--------------------------------------------------------------------------
    | code_length
    |--------------------------------------------------------------------------
    |
    | Эта опция контролирует из какого кол-во цифр будет сформирован код верификации
    |
    */
    "code_length" => 4,

    /*
    |--------------------------------------------------------------------------
    | limit_send_count
    |--------------------------------------------------------------------------
    |
    | Эта опция контролирует лимит на отправление кодов
    |
    */
    "limit_send_count" => 3,

    /*
    |--------------------------------------------------------------------------
    | next_send_after
    |--------------------------------------------------------------------------
    |
    | Эта опция контролирует время через которое можно отправить код повторно
    |
    */
    "next_send_after" => 30,

    /*
    |--------------------------------------------------------------------------
    | expire_seconds
    |--------------------------------------------------------------------------
    |
    | Эта опция контролирует время действия отправленного кода
    |
    */
    "expire_seconds" => 600,

    /*
    |--------------------------------------------------------------------------
    | timeout
    |--------------------------------------------------------------------------
    |
    | Эта опция контролирует время (в сек.) установленного ограничения
    | на отправление новых кодов
    |
    */
    "timeout" => 600,

    /*
    |--------------------------------------------------------------------------
    | flushCode
    |--------------------------------------------------------------------------
    |
    | Эта опция контролирует атомарность записи создания записи в БД
    | Если настройка включена, то новый отправленный код
    | будет затирать и создавать новую строку
    |
    */
    "flushCode" => true,
];